[
  {
    "joke": "A cop pulls Heisenberg over and asks him, \"Do you know how fast you were going?\" Heisenberg replies, \"No, but I know where I am.\""
  },
  {
    "joke": "Two chemimists walk into a bar. The first says \"I'll have some H2O.\" The second says \"I'll have some H2O too.\" The second one dies. "
  },
  {
    "joke": "Q: Did you hear oxygen went on a date with potassium? \nA: It went OK."
  },
  {
    "joke": "A photon checks into a hotel and is asked if he needs any help with his luggage. He says, \"No, I'm traveling light.\""
  },
  {
    "joke": "Q: Did you hear about the man who got cooled to absolute zero? \nA: He's 0K now."
  },
  {
    "joke": "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program.\nThe rest of them will write Perl programs."
  },
  {
    "joke": "To understand what recursion is, you must first understand recursion."
  },
  {
    "joke": "Why programmers like UNIX: who && gawk && uname && talk && date && wine && touch && unzip && strip && touch && finger && mount && fsck && more && yes; yes; more; yes; umount && make clean && sleep"
  },
  {
    "joke": "A programmer had a problem and decided to use Design Patterns to solve it. He now has a ProblemFactory."
  },
  {
    "joke": "An optimist says: \"The glass is half full\". A pessimist says: \"The glass is half empty\". A programmer says; \"The glass is twice as large as it needs to be\"."
  },
  {
    "joke": "All arrays Chuck Norris declares are of infinite size, because Chuck Norris knows no bounds."
  },
  {
    "joke": "Chuck Norris writes code that optimizes itself."
  },
  {
    "joke": "Chuck Norris doesn't need garbage collection because he doesn't call .Dispose(), he calls .DropKick()."
  },
  {
    "joke": "Chuck Norris can write infinite recursion functions and have them return."
  },
  {
    "joke": "\"It works on my machine\" always holds true for Chuck Norris."
  },
  {
    "joke": "Chuck Norris can delete the Recycling Bin."
  },
  {
    "joke": "Chuck Norris can unit test entire applications with a single assert."
  },
  {
    "joke": "Chuck Norris's keyboard doesn't have a Ctrl key because nothing controls Chuck Norris."
  },
  {
    "joke": "During a recent password audit, it was found that a blonde was using the following password: \"MickeyMinniePlutoHueyLouieDeweyDonaldGoofy\" When asked why such a big password, she said that it had to be at least 8 characters long."
  },
  {
    "joke": "Why do programmers get Halloween and Christmas confused? Because Oct 31 = Dec 25."
  },
  {
    "joke": "An infinite number of mathematicians go into a bar. One asks for a pint of beer, the next asks for a half. The third asks for a quarter of a pint, and the fourth asks for an eighth of a pint. The barman pours two pints and says \"Just sort it out among yourselves\"."
  },
  {
    "joke": "A biologist, an engineer, and a mathematician are staking out an empty house.\nThey see two people walk in.\nLater, they see three people walk out.\nThe biologist says, \"They must have multiplied!\"\nThe engineer says, \"I think it was measurement error.\"\nThe mathematician says, \"Now, if exactly one person walks into the house, it will have zero people in it again.\""
  },
  {
    "joke": "Q: Why do blondes tip-toe past medicine cabinets? \nA: So they don't wake up the sleeping pills."
  },
  {
    "joke": "Q: Why did the blonde get so excited about finishing a jigsaw puzzle in six months? \nA: Because the box said it was for \"2 to 4 years.\""
  },
  {
    "joke": "Q: How do you confuse a blonde? \nA: Put her in a circle and tell her to sit in the corner."
  },
  {
    "joke": "Q: cWhy couldn't the blonde dial 9 11? \nA: She couldn't find the eleven."
  }
]