[
  {
    "joke": "Yo mama so poor when I saw her kicking a can down the street, I asked her what she was doing, she said \"Moving.\""
  },
  {
    "joke": "Yo mama so poor she can't afford to pay attention!"
  },
  {
    "joke": "Yo mama so poor when I ring the doorbell she says,\"DING!\""
  },
  {
    "joke": "Yo mama so poor your family ate cereal with a fork to save milk."
  },
  {
    "joke": "Yo mama so poor she was in K-Mart with a box of Hefty bags. I said, \"What ya doin'?\" She said, \"Buying luggage.\""
  },
  {
    "joke": "Yo mama so poor she waves around a popsicle stick and calls it air conditioning."
  },
  {
    "joke": "Yo mama so tall she tripped over a rock and hit her head on the moon."
  },
  {
    "joke": "Yo mama so tall she tripped in Michigan and hit her head in Florida."
  },
  {
    "joke": "Yo mama so bald even a wig wouldn't help!"
  },
  {
    "joke": "Yo mama so bald you can see whats on her mind"
  },
  {
    "joke": "Yo mama so bald that she took a shower and got brain-washed."
  },
  {
    "joke": "Yo mama so hairy Bigfoot is taking her picture!"
  },
  {
    "joke": "Yo mama so dark she went to night school and was marked absent!"
  },
  {
    "joke": "Yo mama so dark she went to night school and was marked absent!"
  },
  {
    "joke": "Yo mama so dark she went to night school and was marked absent!"
  },
  {
    "joke": "Yo mama so short she poses for trophies!"
  },
  {
    "joke": "Yo mama so short she poses for trophies!"
  },
  {
    "joke": "Yo mama so short she has to use a ladder to pick up a dime."
  },
  {
    "joke": "Yo mama so short she can play handball on the curb."
  },
  {
    "joke": "Yo mama so short she does backflips under the bed."
  },
  {
    "joke": "Yo mama so ugly when she joined an ugly contest, they said \"Sorry, no professionals.\""
  },
  {
    "joke": "Yo mama so ugly just after she was born, her mother said \"What a treasure!\" and her father said \"Yes, let's go bury it.\""
  },
  {
    "joke": "Yo mama so ugly they didn't give her a costume when she tried out for Star Wars."
  },
  {
    "joke": "Yo mama so ugly instead of putting the bungee cord around her ankle, they put it around her neck"
  },
  {
    "joke": "Yo mama so ugly she gets 364 extra days to dress up for Halloween."
  },
  {
    "joke": "Yo mama so ugly when she walks into a bank, they turn off the surveillence cameras"
  },
  {
    "joke": "Yo mama so ugly her mom had to tie a steak around her neck to get the dogs to play with her."
  },
  {
    "joke": "Yo mama so ugly when she walks down the street in September, people say \"Wow, is it Halloween already?\""
  },
  {
    "joke": "Yo mama so ugly when she walks down the street in September, people say \"Wow, is it Halloween already?\""
  },
  {
    "joke": "Yo mama so ugly she made an onion cry."
  },
  {
    "joke": "Yo mama so ugly she tried to take a bath the water jumped out!"
  },
  {
    "joke": "Yo mama so ugly even Rice Krispies won't talk to her!"
  },
  {
    "joke": "Yo mama so ugly for Halloween she trick or treats on the phone!"
  },
  {
    "joke": "Yo mama so ugly she turned Medusa to stone!"
  },
  {
    "joke": "Yo mama so ugly The NHL banned her for life"
  },
  {
    "joke": "Yo mama so ugly that your father takes her to work with him so that he doesn't have to kiss her goodbye."
  },
  {
    "joke": "Yo mama so old I told her to act her own age, and she died."
  },
  {
    "joke": "Yo mama so old her social security number is 1!"
  },
  {
    "joke": "Yo mama so old that when she was in school there was no history class."
  },
  {
    "joke": "Yo mama so old she has a picture of Moses in her yearbook."
  },
  {
    "joke": "Yo mama so old her birth certificate says expired on it."
  },
  {
    "joke": "Yo mama so old she knew Burger King while he was still a prince."
  },
  {
    "joke": "Yo mama so old she ran track with dinosaurs."
  },
  {
    "joke": "Yo mama so old her birth certificate is in Roman numerals."
  },
  {
    "joke": "Yo mama head so big she has to step into her shirts."
  },
  {
    "joke": "Yo mama head so big it shows up on radar."
  },
  {
    "joke": "Yo mama teeth are so yellow traffic slows down when she smiles!"
  },
  {
    "joke": "Yo mama's glasses are so thick that when she looks on a map she can see people waving."
  },
  {
    "joke": "Yo mama's glasses are so thick she can see into the future."
  },
  {
    "joke": "Yo mama house so small that when she orders a large pizza she had to go outside to eat it."
  },
  {
    "joke": "Yo mama house so small you have to go outside to change your mind."
  },
  {
    "joke": "Yo mama nose so big she makes Pinochio look like a cat!"
  },
  {
    "joke": "Yo mama nose so big that her neck broke from the weight!"
  },
  {
    "joke": "Yo mama hair so short when she braided it they looked like stiches."
  },
  {
    "joke": "Yo mama feet are so big her shoes have to have license plates!"
  },
  {
    "joke": "Yo mama so clumsy she got tangled up in a cordless phone."
  },
  {
    "joke": "Yo mama cross-eyed and watches TV in stereo."
  },
  {
    "joke": "Yo mama is missing a finger and can't count past nine."
  },
  {
    "joke": "Yo mama middle name is Rambo."
  },
  {
    "joke": "Yo mama rouchy, the McDonalds she works in doesn't even serve Happy Meals."
  },
  {
    "joke": "Yo mama so skinny she hula hoops with a cheerio"
  },
  {
    "joke": "Yo mama so skinny she turned sideways and dissapeared."
  },
  {
    "joke": "Yo mama so lazy she thinks a two-income family is where yo daddy has two jobs."
  },
  {
    "joke": "Yo mama so lazy she's got a remote control just to operate her remote!"
  },
  {
    "joke": "Yo mama so lazy that she came in last place in a recent snail marathon."
  },
  {
    "joke": "Yo mama head so small she use a tea-bag as a pillow."
  },
  {
    "joke": "Yo mama head so small that she got her ear pierced and died."
  },
  {
    "joke": "Yo mama in a wheelchair and says, \"You ain't gonna puch me 'round no more.\""
  },
  {
    "joke": "Yo mama so fat when her beeper goes off, people thought she was backing up"
  },
  {
    "joke": "Yo mama so fat her nickname is \"Lardo\""
  },
  {
    "joke": "Yo mama so fat she eats Wheat Thicks."
  },
  {
    "joke": "Yo mama so fat people jog around her for exercise"
  },
  {
    "joke": "Yo mama so fat she went to the movies and sat next to everyone"
  },
  {
    "joke": "Yo mama so fat she was floating in the ocean and spain claimed her for then new world"
  },
  {
    "joke": "Yo mama so fat she lay on the beach and people run around yelling Free Willy"
  },
  {
    "joke": "Yo mama so fat when she has wants someone to shake her hand, she has to give directions!"
  },
  {
    "joke": "Yo mama so fat she goes to a resturant, looks at the menu and says \"okay!\""
  },
  {
    "joke": "Yo mama so fat when she wears a yellow raincoat, people said \"Taxi!\""
  },
  {
    "joke": "Yo mama so fat she put on her lipstick with a paint-roller"
  },
  {
    "joke": "Yo mama so fat when she tripped over on 4th Ave, she landed on 12th"
  },
  {
    "joke": "Yo mama so fat when she bungee jumps, she brings down the bridge too"
  },
  {
    "joke": "Yo mama so fat the highway patrol made her wear \"Caution! Wide Turn\""
  },
  {
    "joke": "Yo mama so fat when she steps on a scale, it read \"one at a time, please\""
  },
  {
    "joke": "Yo mama so fat when she gets on the scale it says we don't do livestock."
  },
  {
    "joke": "Yo mama so fat she's got her own area code!"
  },
  {
    "joke": "Yo mama so fat she looks like she's smuggling a Volkswagon!"
  },
  {
    "joke": "Yo mama so fat NASA has to orbit a satellite around her!"
  },
  {
    "joke": "Yo mama so fat whenever she goes to the beach the tide comes in!"
  },
  {
    "joke": "Yo mama so fat when she plays hopscotch, she goes New York, L.A., Chicago"
  },
  {
    "joke": "Yo mama so fat she wakes up in sections!"
  },
  {
    "joke": "Yo mama so fat she rolled over 4 quarters and it made a dollar!"
  },
  {
    "joke": "Yo mama so fat when she lies on the beach no one else gets sun!"
  },
  {
    "joke": "Yo mama so fat when she bunje jumps she goes straight to hell!"
  },
  {
    "joke": "Yo mama so fat when she jumps up in the air she gets stuck!!!"
  },
  {
    "joke": "Yo mama so fat everytime she walks in high heels, she strikes oil!"
  },
  {
    "joke": "Yo mama so fat she fell and made the Grand Canyon!"
  },
  {
    "joke": "Yo mama so fat she sat on the beach and Greenpeace threw her in!"
  },
  {
    "joke": "Yo mama is so old that her bus pass is in hieroglyphics!!"
  },
  {
    "joke": "Yo mamas so fat she walked in front of the tv and I missed 3 commercials."
  },
  {
    "joke": "Yo mama so poor I stepped in her house and I was in the backyard."
  },
  {
    "joke": "Yo mama is so hairy, that Bigfoot triedto take her picture!"
  },
  {
    "joke": "Yo mama's so fat when she takes a bath she fills the tub then turns on the water."
  },
  {
    "joke": "Yo mama so fat she wears a vcr as a beeper."
  },
  {
    "joke": "Yo mama is so fat that when she went bunggie jumping in a yellow dress, everyone was screaming the suns falling!"
  },
  {
    "joke": "Yo mama is so poor when her friend came over to usethe bathroom she said ok, choose a corner."
  },
  {
    "joke": "Yo mama's so fat, when she was in school she sat next to everybody!"
  },
  {
    "joke": "Yo mama is so fat...that when she wore a blue and green sweater,everyone thoughtshe was Planet Earth"
  },
  {
    "joke": "Yo mama is so fat...that she broke a branch in herfamily tree!"
  },
  {
    "joke": "Yo mama's like the sun you look at her to long you will go blind!"
  },
  {
    "joke": "Yo mamas so fat it took me a bus and two trains just to get on her good side."
  },
  {
    "joke": "Yo mama is so stupid she sold her car for gas money."
  },
  {
    "joke": "Yo mama so fat she uses the interstate as aslip and slide."
  },
  {
    "joke": "Yo mama is so ugly the government movedhalloween to her birthday."
  },
  {
    "joke": "Yo mama so stupid she stole free bread."
  },
  {
    "joke": "Yo mama so fat the last time she saw 90210 was on the scale!"
  },
  {
    "joke": "Yo mama so fat she has more chins than a chinese phone book"
  },
  {
    "joke": "Yo mama so fat when God said, \"Let there be light\" he he to ask her to move out of the way."
  },
  {
    "joke": "Yo mama's so fat, when she goes to Taco Bell, they run for the border !!"
  },
  {
    "joke": "Yo mama has so many chins, it looks like she's wearing a fat necklace !!"
  },
  {
    "joke": "Yo mama's so stupid that she burned down the house with a CD burner."
  },
  {
    "joke": "Yo mama's house is so small you have to go outside to change your mind."
  },
  {
    "joke": "Yo mama's so stupid, she ordered a cheeseburger without the cheese."
  },
  {
    "joke": "Yo mama's so stupid she can't pass a blood test."
  },
  {
    "joke": "Yo mama's so fat, when she turns around they throw her a welcome back party."
  },
  {
    "joke": "Yo mama is so fat that she needs a book mark to keep track of all her chin rolls!"
  }
]